-- name = "Армянский алфавит"
-- description = "Армянский алфавит с транскрипцией"
-- type = "widget"
-- author = "Evgeny Zobnin (zobnin@gmail.com)"
-- version = "1.0"
-- lang = "ru"

local tab = {
{
    "<b>Աա</b>", "А",
    "<b>Բբ</b>", "Б",
    "<b>Գգ</b>", "Г",
    "<b>Դդ</b>", "Д",
    "<b>Եե</b>", "Е",
    "<b>Զզ</b>", "З",
},
{
    "<b>Էէ</b>", "Э",
    "<b>Ըը</b>", "Ы",
    "<b>Թթ</b>", "Тh",
    "<b>Ժժ</b>", "Ж",
    "<b>Իի</b>", "И",
    "<b>Լլ</b>", "Ль",
},
{
    "<b>Խխ</b>", "Х",
    "<b>Ծծ</b>", "Ц",
    "<b>Կկ</b>", "K",
    "<b>Հհ</b>", "h",
    "<b>Ձձ</b>", "Дз",
    "<b>Ղղ</b>", "Гг",
},
{
    "<b>Ճճ</b>", "Ч",
    "<b>Մմ</b>", "М",
    "<b>Յյ</b>", "Й",
    "<b>Նն</b>", "Н",
    "<b>Շշ</b>", "Ш",
    "<b>Ոո</b>", "О",
},
{
    "<b>Չչ</b>", "Ч",
    "<b>Պպ</b>", "П",
    "<b>Ջջ</b>", "Дж",
    "<b>Ռռ</b>", "Рр",
    "<b>Սս</b>", "С",
    "<b>Վվ</b>", "В",
},
{
    "<b>Տտ</b>", "Т",
    "<b>Րր</b>", "Р",
    "<b>Ցց</b>", "Цh",
    "<b>Ու</b>", "У",
    "<b>Փփ</b>", "Пh",
    "<b>Քք</b>", "Kh",
},
{
    "<b>և</b>", "Ев",
    "<b>Oo</b>", "О",
    "<b>Ֆֆ</b>", "Ф",
}
}

function on_resume()
    ui:show_table(tab)
end
